Revit 2027 API
RebarBendData.BarModelDiameter Property
 Defines the model diameter of the bar. The default value is 0.0. When this is changed, the CrankStraightLength0, CrankStraightLength1, CrankAnledLength0, CrankAnledLength1 will be recomputed.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BarModelDiameter { get; set; }
Public Property BarModelDiameter As Double
	Get
	Set
public:
property double BarModelDiameter {
	double get ();
	void set (double value);
}
member BarModelDiameter : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for barModelDiameter is not finite
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace